cask_args appdir: "/Applications"

tap "caskroom/cask"

brew "openssl"

cask "google-chrome"

cask "caskroom/versions/java8"
brew "gradle"
brew "node"
brew "nvm"

cask "atom"
cask "docker"
cask "intellij-idea"
cask "slack"
cask "dropbox"

brew "rbenv"
brew "ruby-build"
brew "git-crypt"
brew "gnupg"
brew "direnv"
cask "tunnelblick"
cask "keepassxc"
cask "iterm2"

