# Cask
cask_args appdir: "/Applications"
tap "homebrew/homebrew-cask"

# Programming
brew "leiningen"
brew "node"
brew "nvm"
brew "rbenv"
brew "ruby-build"
brew "go"
brew "yarn"

# Git
brew "git"
brew "git-crypt"
brew "git-plus"

# CLI
cask "iterm2"
brew "direnv"
brew "gnupg"
brew "jq"
brew "openssl"
brew "coreutils"
brew "the_silver_searcher"
brew "wget"

#Database
brew "postgresql"

#Infra
brew "terraform"
brew "vault"

#AWS
brew "awscli"
cask "aws-vault"

# Apps
cask "atom"
cask "authy"
cask "docker"
cask "dropbox"
cask "intellij-idea"
cask "keepassxc"
cask "postman"
cask "spectacle"
